
{
  "site": {
    "footer": "Built with Gatsby"
  },
  "header":{
    "menu": "Menu",
    "close":"Close",
    "about":"About",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "test": "hello",
    "title":"",
    "content": "Hi, I'm Coleen Huang, a web developer based in the Sacramento Area.",
    "link": "Go to page 2"
  },
  "page2": {
    "title": "Hi from the second page",
    "content": "Welcome to page 2",
    "link": "Go back to the homepage"
  },
  "about":{
    "title": "About",
    "content": "My fascination with programming began when I saw my dad write a program to solve his sudoku puzzles for him. It opened a new door for me, as it showed how programming as basically harnessing the power of computers to make our lives easier.\n I love programming, as it allows me to satisfy my love for learning and creating new things, as I create new apps and websites to try out new technologies. It also gives me the opportunity to create applications that make my life easier, such as a weather app that not only tells me the weather but also if I need a bike light or not.\n If I’m not working on my next app or website, you’ll probably either find me in the kitchen, making my next loaf of sourdough bread, or on the sofa reading a book."
  },
  "projects": {
    "title": "Projects",
    "technology": "Technologies used:",
    "repo": "Repo",
    "demo": "Demo",
    "projectList": [
      {
        "title":"Bike Weather App",
        "img_name": "projects/bikeweatherapp.png",
        "tech":"Html, CSS, Javascript, Vue",
        "description":"I've always had a hard time knowing whether I needed a bike light or not, since the time the sun sets varies a lot according to the time of the year. This weather app was made to solve that problem. It's revamped from a previous app made using jQuery.",
        "repo_link":"https://github.com/coleenhuang/bikeweatherapp-vue",
        "demo_link":"https://coleenhuang.github.io/bikeweatherapp-vue/#/"
      },
      {
        "title":"Ancient Greek Quiz App",
        "img_name": "projects/quizapp.png",
        "tech":"Html, CSS, Javascript, jQuery",
        "description":"Inspired my love of Classics and Ancient Greece, I created this app to test people on trivia about Ancient Greece.",
        "repo_link":"https://github.com/coleenhuang/Ancient-Greece-quiz",
        "demo_link":"https://coleenhuang.github.io/Ancient-Greece-quiz/greek-quiz-app"
      }
    ]
  },
  "contact": {
    "title": "Contact"
  }
}
